app/views/shopping_carts/orders.html.erb

SELECT  "shopping_carts".* FROM "shopping_carts" WHERE "shopping_carts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
Shopping Cart ID: <%= key %><br>
<% cart = ShoppingCart.find(key.to_i) %>