app/controllers/buyers_controller.rb

  def create
    buyer = Buyer.create(buyer_params)
    session[:buyer_id] = buyer.id
    new_shopping_cart = ShoppingCart.create(buyer_id: session[:buyer_id])
---
INSERT INTO "buyers" ("name", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "vronnieli"], ["created_at", 2016-10-11 22:02:14 UTC], ["updated_at", 2016-10-11 22:02:14 UTC], ["password_digest", "$2a$10$XcKiO4rGQ1OLVYnEQSWAEOfa6mb.IBCK4KZiOU71csVMJa3LLD00q"]]
INSERT INTO "shopping_carts" ("buyer_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["buyer_id", 1], ["created_at", 2016-10-11 22:02:14 UTC], ["updated_at", 2016-10-11 22:02:14 UTC]]

  def show
    if params[:id].to_i != current_buyer.id
      redirect_to '/'
    else
      @buyer = Buyer.find(params[:id])
---
SELECT  "buyers".* FROM "buyers" WHERE "buyers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def edit
    @buyer = Buyer.find(params[:id])
---
SELECT  "buyers".* FROM "buyers" WHERE "buyers"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def update
    buyer = Buyer.find(current_buyer.id)
    buyer.update(buyer_params)
---
SELECT  "buyers".* FROM "buyers" WHERE "buyers"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "buyers" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "buyers"."id" = ?  [["name", "pencil"], ["password_digest", "$2a$10$.f2Z2uw2pstnP/AM3qEjX../8q/MEbYBNCG0ChTc0xhqNC6SHu3n6"], ["updated_at", 2016-08-29 13:54:05 UTC], ["id", 7]]

  def destroy
  current_buyer.delete
---
DELETE FROM "buyers" WHERE "buyers"."id" = ?  [["id", 8]]