app/controllers/line_items_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "line_items".* FROM "line_items" WHERE "line_items"."shopping_cart_id" = ? AND "line_items"."product_id" = ? ORDER BY "line_items"."id" ASC LIMIT ?  [["shopping_cart_id", 2], ["product_id", 1], ["LIMIT", 1]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", 2016-08-27 23:04:24 UTC], ["id", 2]]
SELECT  "shopping_carts".* FROM "shopping_carts" WHERE "shopping_carts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def create
    product = Product.find(params[:line_item][:product_id])
    if product.quantity < params[:line_item][:quantity].to_i || params[:line_item][:quantity].to_i <= 0
      flash[:notice] = "There is either not enough stock or you have entered an incorrect quantity."
      redirect_to product_path(product)
    else
      line_item = LineItem.where(:shopping_cart_id => active_cart.id, :product_id => params[:line_item][:product_id]).first_or_initialize
      if line_item.quantity
        line_item.quantity+=params[:line_item][:quantity].to_i
        line_item.save
      else
        line_item.quantity = params[:line_item][:quantity]
        line_item.save
      end
      shopping_cart = ShoppingCart.find(active_cart.id)

SELECT  "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 3], ["updated_at", 2016-08-27 20:28:57 UTC], ["id", 1]]
SELECT  "shopping_carts".* FROM "shopping_carts" WHERE "shopping_carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    line_item = LineItem.find(params[:id])
    product = line_item.product
      if product.quantity < params[:line_item][:quantity].to_i || params[:line_item][:quantity].to_i <= 0
      flash[:notice] = "There is either not enough stock or you have entered an incorrect quantity."
      redirect_to shopping_cart_path(active_cart)
    else
      line_item.update(safe_params)
      shopping_cart = ShoppingCart.find(params[:line_item][:shopping_cart_id])

SELECT  "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 27]]
---
  def destroy
    line_item = LineItem.find(params[:id])
    line_item.destroy