app/controllers/line_items_controller.rb

  def reset

    line_items = LineItem.where(shopping_cart_id: active_cart.id)
    line_items.each do |item|
      item.quantity=0
      item.save
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."shopping_cart_id" = ?  [["shopping_cart_id", 10]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 0], ["updated_at", 2016-08-28 20:13:32 UTC], ["id", 15]]