app/controllers/sessions_controller.rb

  def create
    buyer = Buyer.find_by(name: buyer_params[:name])
---
SELECT  "buyers".* FROM "buyers" WHERE "buyers"."name" = ? LIMIT ?  [["name", "Veronica"], ["LIMIT", 1]]