app/controllers/shopping_carts_controller.rb

  def update
    @shopping_cart = active_cart
    no_stock = @shopping_cart.line_items.any? do |line_item|
      line_item.product.quantity < line_item.quantity
    end
    if no_stock
      redirect_to shopping_cart_path(@shopping_cart)
      flash[:notice] = "There are not enough items in stock to satisfy your order."
    else
      @shopping_cart.line_items.each do |line_item|
        line_item.product.quantity-= line_item.quantity
        line_item.product.save
      end
      @shopping_cart.status = false
      @shopping_cart.save
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."shopping_cart_id" = ?  [["shopping_cart_id", 10]]
UPDATE "products" SET "quantity" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["quantity", 9], ["updated_at", 2016-08-29 14:22:31 UTC], ["id", 1]]
INSERT INTO "shopping_carts" ("buyer_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["buyer_id", 1], ["created_at", 2016-10-11 22:05:50 UTC], ["updated_at", 2016-10-11 22:05:50 UTC]]
UPDATE "shopping_carts" SET "status" = ?, "updated_at" = ? WHERE "shopping_carts"."id" = ?  [["status", false], ["updated_at", 2016-08-28 18:43:30 UTC], ["id", 4]]

  def destroy
    shopping_cart = ShoppingCart.find(params[:id])
    shopping_cart.destroy
    ShoppingCart.create(buyer_id: session[:buyer_id])
---
SELECT  "shopping_carts".* FROM "shopping_carts" WHERE "shopping_carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "shopping_carts" WHERE "shopping_carts"."id" = ?  [["id", 1]]
INSERT INTO "shopping_carts" ("buyer_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["buyer_id", 1], ["created_at", 2016-10-11 22:02:42 UTC], ["updated_at", 2016-10-11 22:02:42 UTC]]

  def orders
    @orders = ShoppingCart.where(buyer_id: session[:buyer_id], status: false)
    if @orders
      @line_items = {}
      @orders.each do |order|
---
SELECT  "shopping_carts".* FROM "shopping_carts" WHERE "shopping_carts"."buyer_id" = ? AND "shopping_carts"."status" = ? ORDER BY "shopping_carts"."id" ASC LIMIT ?  [["buyer_id", 7], ["status", true], ["LIMIT", 1]]
SELECT  "shopping_carts".* FROM "shopping_carts" WHERE "shopping_carts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]