app/views/products/show.html.erb

<%= form_for(@line_item) do |f| %>
<!-- Cart ID: <%= f.collection_select(:shopping_cart_id, ShoppingCart.all, :id, :id) %> -->
---
SELECT "shopping_carts".* FROM "shopping_carts"